app/controllers/bills_controller.rb

  def index
    @bills = Bill.all
---
SELECT "bills".* FROM "bills"

  def create
    authorize! :manage, Bill
    @bill = Bill.new(bill_params)
    @bill.author = current_user.email
    respond_to do |format|
      if @bill.save
---
INSERT INTO "bills" ("author", "created_at", "limit_date", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "eu"], ["created_at", Thu, 17 Jul 2014 13:04:37 UTC +00:00], ["limit_date", Thu, 17 Jul 2014], ["name", "dasdadasd"], ["updated_at", Thu, 17 Jul 2014 13:04:37 UTC +00:00]]

  def update
    respond_to do |format|
      if @bill.update(bill_params)
---
UPDATE "bills" SET "status" = ?, "updated_at" = ? WHERE "bills"."id" = 46

  def destroy
    authorize! :manage, Bill
    @bill.destroy
---
DELETE FROM "bills" WHERE "bills"."id" = ?  [["id", 3]]

  def change_status
    @bill = Bill.find(params[:id])
---
SELECT  "bills".* FROM "bills"  WHERE "bills"."id" = ? LIMIT 1

  def change_status_failed
    @bill = Bill.find(params[:id])
---
SELECT  "bills".* FROM "bills"  WHERE "bills"."id" = ? LIMIT 1

  def need_checkout
    @bills = Bill.all
    @bills_wait = @bills.where(status: 'Waiting')
    # @bills_proc = @bills.where(status: 'Processing')
    # @bills_proc.order('bills.updated_at DESC ')
    @bills_wait.order('bills.updated_at DESC ')
    # .map{|b| {id: b.id}}
    render json: @bills_wait.pluck(:id)
    if @bills_wait.any?
---
SELECT "bills".* FROM "bills"
SELECT "bills"."id" FROM "bills"  WHERE "bills"."status" = 'Waiting'
SELECT COUNT(*) FROM "bills"  WHERE "bills"."status" = 'Waiting'

  def set_bill
    @bill = Bill.find(params[:id])
---
SELECT "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT 1  [["id", "5"]]