app/controllers/line_items_controller.rb

  def index
    @bill = Bill.find(params[:bill_id])
---
SELECT  "bills".* FROM "bills"  WHERE "bills"."id" = ? LIMIT 1

  def new
    @bill = Bill.find(params[:bill_id])
---
SELECT "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT 1  [["id", "17"]]

  def create
    @line_item = LineItem.new(line_item_params.merge(bill_id: params[:bill_id]))
    authorize! :create, LineItem
    respond_to do |format|
      if @line_item.save
---
INSERT INTO "line_items" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 18 Jul 2014 08:04:22 UTC +00:00], ["description", ""], ["title", ""], ["updated_at", Fri, 18 Jul 2014 08:04:22 UTC +00:00]]

  def update
    authorize! :update, LineItem
    respond_to do |format|
      if @line_item.update(line_item_params)
---
UPDATE "line_items" SET "title" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "line_items"."id" = 27  [["title", "Dus"], ["description", "De acasa"], ["price", #<BigDecimal:7fbc2043a380,'0.19333E3',18(18)>], ["updated_at", Fri, 18 Jul 2014 13:45:51 UTC +00:00]]

  def destroy
    authorize! :destroy, LineItem
    @line_item = LineItem.find(params[:id])
    @line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 2]]