app/controllers/users_controller.rb

  def create
    authorize! :manage, :all
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "role", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    authorize! :manage, :all
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]